Class:
بتتخزن في الـ Heap (عشان كده هي Reference Type).
بتدعم الوراثة (Inheritance) عادي جداً.
بنستخدمها في الأغلب مع الكلاسات الكبيرة والبيانات اللي بتتغير كتير.
Struct:
بتتخزن في الـ Stack (عشان كده هي Value Type)، وده بيخليها أسرع وأخف.
مش بتدعم الوراثة.
بنستخدمها للبيانات الصغيره والخفيفة جداً اللي مش محتاجة تعديل كبير (زي Coordinates أو Point).
Record:
ميزة جديدة في C# ومصممة أساساً للبيانات الثابتة اللي مش بتتغير (Immutable).
الميزة الحلوة فيها إنها بتقارن القيم اللي جوه الأوبجكت مش مكانه في الـ Memory (يعني Value-based Equality).
بتسهل كتابة الكود وتخلي شكله أقصر وأوضح..

  يعني اي ال Indexer?!
  الـ Indexer هو طريقة في C# بتخليني أقدر أتعامل مع الأوبجكت كأنه Array أو List.
بدل ما أعمل الميثود العادية عشان أجيب قيمة، بستخدم الأقواس المربعة على طول زي كده: myObject[0].
بنكتبه جوه الكلاس باستخدام كلمة this[].
فايدته: بيسهل الوصول للبيانات وبيخلي الكود شكله أسهل وأبسط بكتير.
